#include "draw.h"
void drawFrame(void)
{
    printf("\t****************************************************\n");
    printf("\t**                                                **\n");
    printf("\t**           欢迎来到平衡二叉树实验中心           **\n");
    printf("\t**                                                **\n");
    printf("\t****************************************************\n");

    printf("\t**\t    1. 随机生成二叉树                     **\n");
    printf("\t**\t    2. 手动输入数据生成二叉树             **\n");
    printf("\t**\t    3. 获取二叉树节点数                   **\n");
    printf("\t**\t    4. 获取二叉树深度                     **\n");
    printf("\t**\t    5. 寻找二叉树节点                     **\n");
    printf("\t**\t    6. 删除二叉树节点                     **\n");
    printf("\t**\t    7. 获得二叉树中排第k的节点            **\n");
    printf("\t**\t    8. 向二叉树插入新节点                 **\n");
    printf("\t**\t    9. 销毁二叉树                         **\n");
    printf("\t**\t    10.遍历二叉树                         **\n");
    printf("\t**\t    11.选择是否自动展示二叉树             **\n");
    printf("\t**\t    12.退出实验中心                       **\n");
    printf("\t**\t                                          **\n");
    printf("\t**\t请输入您的选择：                          **\n");
    printf("\t****************************************************\n");
}
